Thanks for response @juliocc. I'm sorry, what do you mean by trying with HEAD?

I think the problem is with the fact that the Cloud DNS zone resource was created with old version of the module, which introduced the DNSSEC config (with state = "off").

With old version of the module:
```
module "test-zone" {
  source      = "github.com/GoogleCloudPlatform/cloud-foundation-fabric//modules/dns?ref=v23.0.0"
  project_id  = "<project>"
  name        = "test-zone"
  domain      = "<redacted>"
  type        = "public"
```

We get:

```
  + resource "google_dns_managed_zone" "public" {
      + creation_time    = (known after apply)
      + dns_name         = "<redacted>"
      + effective_labels = (known after apply)
      + force_destroy    = false
      + id               = (known after apply)
      + managed_zone_id  = (known after apply)
      + name             = "test-zone"
      + name_servers     = (known after apply)
      + project          = "<redacted>"
      + terraform_labels = (known after apply)
      + visibility       = "public"

      + dnssec_config {
          + kind          = "dns#managedZoneDnsSecConfig"
          + non_existence = "nsec3"
          + state         = "off"

          + default_key_specs {
              + algorithm  = "rsasha256"
              + key_length = 2048
              + key_type   = "keySigning"
              + kind       = "dns#dnsKeySpec"
            }
          + default_key_specs {
              + algorithm  = "rsasha256"
              + key_length = 1024
              + key_type   = "zoneSigning"
              + kind       = "dns#dnsKeySpec"
            }
        }
    }
```
So the `dnssec_config` block is introduced with `state = off`. 

When creating new resource with v27 module:
```
module "test-zone" {
  source      = "github.com/GoogleCloudPlatform/cloud-foundation-fabric//modules/dns?ref=v27.0.0"
  project_id  = "<redacted>"
  name        = "test-zone"
  
  zone_config = {
    domain = "<domain>"
    public = {}
  }
}
```
It works fine and doesn't create the `dnssec_config` block.

Now, when we have upgraded our modules to v27, terraform tries to remove this dnssec_config, but apply fails. Terraform state is still updated to not have it. When I import the resource from GCP again to state, it has the dnssec_config block (state = "off").

So maybe this is something to consider with module declaration. For new resources, everything works fine. But when migrating to resources created with older module to new, some inconsitency happens.